In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'Country':['USA','Egypt','Australia'],
               'Age':[24,23,32],
               'Salary':[70000,75000,80000],
               'Vehicles':['Yes','No','Yes']})

In [3]:
df

     Country  Age  Salary Vehicles
0        USA   24   70000      Yes
1      Egypt   23   75000       No
2  Australia   32   80000      Yes

1. Label encoding
2. One hot encoding
3. Binary encoding

## Label encoding

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
le=LabelEncoder()

In [6]:
df

     Country  Age  Salary Vehicles
0        USA   24   70000      Yes
1      Egypt   23   75000       No
2  Australia   32   80000      Yes

In [7]:
df['encoded_countries']=le.fit_transform(df['Country'])

In [8]:
df

     Country  Age  Salary Vehicles  encoded_countries
0        USA   24   70000      Yes                  2
1      Egypt   23   75000       No                  1
2  Australia   32   80000      Yes                  0

## One hot encoding

In [9]:
x=pd.get_dummies(df['Country'])
x

   Australia  Egypt  USA
0          0      0    1
1          0      1    0
2          1      0    0

In [10]:
x['country_names']=df['encoded_countries']

In [11]:
x

   Australia  Egypt  USA  country_names
0          0      0    1              2
1          0      1    0              1
2          1      0    0              0

## Binary encoding

In [12]:
df

     Country  Age  Salary Vehicles  encoded_countries
0        USA   24   70000      Yes                  2
1      Egypt   23   75000       No                  1
2  Australia   32   80000      Yes                  0

In [13]:
df['Occupation']=['Data Engineer','Data Scientist','Data Analyst']

In [14]:
df

     Country  Age  Salary Vehicles  encoded_countries      Occupation
0        USA   24   70000      Yes                  2   Data Engineer
1      Egypt   23   75000       No                  1  Data Scientist
2  Australia   32   80000      Yes                  0    Data Analyst

In [15]:
#pip install category_encoders

In [16]:
import category_encoders as ce

In [17]:
cenc=ce.BinaryEncoder(cols=['Occupation'])

In [19]:
cenc

BinaryEncoder(cols=['Occupation'])

In [20]:
df

     Country  Age  Salary Vehicles  encoded_countries      Occupation
0        USA   24   70000      Yes                  2   Data Engineer
1      Egypt   23   75000       No                  1  Data Scientist
2  Australia   32   80000      Yes                  0    Data Analyst

In [21]:
df_binary=cenc.fit_transform(df)

In [22]:
df_binary

,Country,Age,Salary,Vehicles,encoded_countries,Occupation_0,Occupation_1
0,USA,24,70000,Yes,2,0,1
1,Egypt,23,75000,No,1,1,0
2,Australia,32,80000,Yes,0,1,1

    Practical use of encoding 
[] dfd=iot.apply(lambda.col: lefit_transform(col.astype(str)),
                axis=0,result_type='expand')